Revit 2015 API
DocumentEntryPoint Members
The DocumentEntryPoint type exposes the following members.
Constructors
Name | Description
DocumentEntryPoint
Initializes a new instance of the DocumentEntryPoint class
Methods
Name | Description
CanPlaceElementType
 Verifies that the user can be prompted to place the input element type on the current active view.
 (Inherited from UIDocument.)
Dispose |  (Inherited from UIDocument.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FinishInitializationEO
 For Revit Macros internal use only.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOpenUIViews
Get a list of all open view windows in the Revit user interface.
 (Inherited from UIDocument.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Initialize
 For Revit Macros internal use only.
OnShutdownEO
 For Revit Macros internal use only.
PostRequestForElementTypePlacement
 Places a request on Revit's command queue for the user to place instances of the specified ElementType. This does not execute immediately, but instead when control returns to Revit from the current API context.
 (Inherited from UIDocument.)
PromptForFamilyInstancePlacement(FamilySymbol)
Prompts the user to place instances of the specified FamilySymbol.
 (Inherited from UIDocument.)
PromptForFamilyInstancePlacement(FamilySymbol, PromptForFamilyInstancePlacementOptions)
Prompts the user to place instances of the specified FamilySymbol.
 (Inherited from UIDocument.)
PromptToMatchElementType
 Prompts the user to select elements to change them to the input type.
 (Inherited from UIDocument.)
PromptToPlaceElementTypeOnLegendView
 Prompts the user to place an element type onto a legend view.
 (Inherited from UIDocument.)
PromptToPlaceViewOnSheet
 Prompts the user to place a specified view onto a sheet.
 (Inherited from UIDocument.)
RefreshActiveView
Refresh the display of the active view in the active document.
 (Inherited from UIDocument.)
RequestViewChange
 Requests an asynchronous change of the active view in the currently active document.
 (Inherited from UIDocument.)
SaveAndClose
Close the document, prompting the user for saving it when necessary.
 (Inherited from UIDocument.)
SaveAs
 Saves the document to a file name obtained from the Revit user without prompting the user ot overwrite a file if it exists.
 (Inherited from UIDocument.)
ShowElements(Element)
Shows the element by zoom to fit.
 (Inherited from UIDocument.)
ShowElements(ElementId)
Shows the element by zoom to fit.
 (Inherited from UIDocument.)
ShowElements(ICollection<ElementId>)
Shows the elements by zoom to fit.
 (Inherited from UIDocument.)
ShowElements(ElementSet)
Shows the elements by zoom to fit.
 (Inherited from UIDocument.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ActiveGraphicalView
 The currently active graphical view of the currently active document.
 (Inherited from UIDocument.)
ActiveView
 The currently active view of the currently active document.
 (Inherited from UIDocument.)
AddinFolder
 The full path to the Revit Macros module.
Application
 Retrieves an object that represents the current Application.
 (Inherited from UIDocument.)
Document
Returns the database level document represented by this UI-level document.
 (Inherited from UIDocument.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from UIDocument.)
Selection
Retrieve the currently selected Elements in Autodesk Revit.
 (Inherited from UIDocument.)
See Also
DocumentEntryPoint Class
Autodesk.Revit.UI.Macros Namespace